docs/pages/algorithm/math.html
---
layout: default
title: Math
nav_exclude: true
---
<div id="outline-container-org6b0e12c" class="outline-2">
<h2 id="org6b0e12c"><span class="section-number-2">1.</span> Modulo %</h2>
<div class="outline-text-2" id="text-1">
<p>
key concept for % is congruence, two numbers a, b are congruent on n, if and only if they have the same modular remainder after mod by n
</p>

<p>
if a % n = b, then we say a and b is congruent on n, marked as a ≡ b (mod n)
</p>

<p>
Key Attributes of Modulo Congruence:
</p>
<ol class="org-ol">
<li>Reflexivity: a ≡ a (mod n)</li>
<li>Symmetry: If a ≡ b (mod n), then b ≡ a (mod n)</li>
<li>Transitivity: If a ≡ b (mod n) and b ≡ c (mod n), then a ≡ c (mod n)</li>
<li>Addition: If a ≡ b (mod n) and c ≡ d (mod n), then a + b ≡ c + d (mod n)</li>
<li>Multiplication: If a ≡ b (mod n) and c ≡ d (mod n), then a * b ≡ c * d (mod n)</li>
<li>Divisibility: If a ≡ b (mod n), then a - b is divisible by n, in other words: a - b | n</li>
<li>Power: If a ≡ b (mod n), then a<sup>k</sup> ≡ b<sup>k</sup> (mod n)</li>
</ol>
</div>
</div>
<div id="outline-container-orgcd074ab" class="outline-2">
<h2 id="orgcd074ab"><span class="section-number-2">2.</span> Greatest Command Divisor</h2>
<div class="outline-text-2" id="text-2">
<p>
Euclidean Algorithm:
</p>
<div class="org-src-container">
<pre class="src src-nil">gcd(a, 0) = a
gcd(a, b) = gcd(b, a % b)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #ECBE7B;">int</span> <span style="color: #c678dd;">gcd</span>(<span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">a</span>, <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">b</span>) {
  <span style="color: #51afef;">while</span>(b != <span style="color: #da8548; font-weight: bold;">0</span>) {
    <span style="color: #ECBE7B;">int</span> <span style="color: #dcaeea;">temp</span> = b;
    b = a % b;
    a = temp;
  }
  <span style="color: #51afef;">return</span> a;
}

</pre>
</div>
</div>
</div>
